package com.example.trans.myapplication.utils;

public class WeatherTestJson {
    public static String json="{" +
            "\"code\":1000," +
            "    \"message\": \"success\"," +
            "    \"data\": {" +
            "        \"city\": \"绵阳市\"," +
            "        \"district\": \"涪城区\"," +
            "        \"date\": \"2018-07-13\"," +
            "        \"week\": \"星期五\"," +
            "        \"weather\": \"阴\"," +
            "        \"temp\": \"25\"," +
            "        \"img\": \"2\"," +
            "        \"humidity\": \"82\"," +
            "        \"winddirect\": \"东北风\"," +
            "        \"windpower\": \"1级\"," +
            "        \"ipm2_5\": \"37\"," +
            "        \"quality\": \"优\"," +
            "        \"daily\": [" +
            "            {" +
            "                \"date\": \"2018-07-13\"," +
            "                \"week\": \"星期五\"," +
            "                \"sunrise\": \"06:05\"," +
            "                \"sunset\": \"20:08\"," +
            "                \"night\": {" +
            "                    \"weather\": \"中雨\"," +
            "                    \"templow\": \"23\"," +
            "                    \"img\": \"8\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }," +
            "                \"day\": {" +
            "                    \"weather\": \"阵雨\"," +
            "                    \"temphigh\": \"30\"," +
            "                    \"img\": \"3\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }" +
            "            }," +
            "            {" +
            "                \"date\": \"2018-07-14\"," +
            "                \"week\": \"星期六\"," +
            "                \"sunrise\": \"06:05\"," +
            "                \"sunset\": \"20:08\"," +
            "                \"night\": {" +
            "                    \"weather\": \"中雨\"," +
            "                    \"templow\": \"23\"," +
            "                    \"img\": \"8\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }," +
            "                \"day\": {" +
            "                    \"weather\": \"中雨\"," +
            "                    \"temphigh\": \"29\"," +
            "                    \"img\": \"8\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }" +
            "            }," +
            "            {" +
            "                \"date\": \"2018-07-15\"," +
            "                \"week\": \"星期日\"," +
            "                \"sunrise\": \"06:06\"," +
            "                \"sunset\": \"20:07\"," +
            "                \"night\": {" +
            "                    \"weather\": \"阵雨\"," +
            "                    \"templow\": \"23\"," +
            "                    \"img\": \"3\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }," +
            "                \"day\": {" +
            "                    \"weather\": \"阵雨\"," +
            "                    \"temphigh\": \"29\"," +
            "                    \"img\": \"3\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }" +
            "            }," +
            "            {" +
            "                \"date\": \"2018-07-16\"," +
            "                \"week\": \"星期一\"," +
            "                \"sunrise\": \"06:07\"," +
            "                \"sunset\": \"20:07\"," +
            "                \"night\": {" +
            "                    \"weather\": \"小雨\"," +
            "                    \"templow\": \"23\"," +
            "                    \"img\": \"7\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }," +
            "                \"day\": {" +
            "                    \"weather\": \"小雨\"," +
            "                    \"temphigh\": \"28\"," +
            "                    \"img\": \"7\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }" +
            "            }," +
            "            {" +
            "                \"date\": \"2018-07-17\"," +
            "                \"week\": \"星期二\"," +
            "                \"sunrise\": \"06:07\"," +
            "                \"sunset\": \"20:07\"," +
            "                \"night\": {" +
            "                    \"weather\": \"小雨\"," +
            "                    \"templow\": \"24\"," +
            "                    \"img\": \"7\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }," +
            "                \"day\": {" +
            "                    \"weather\": \"小雨\"," +
            "                    \"temphigh\": \"29\"," +
            "                    \"img\": \"7\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }" +
            "            }," +
            "            {" +
            "                \"date\": \"2018-07-18\"," +
            "                \"week\": \"星期三\"," +
            "                \"sunrise\": \"06:08\"," +
            "                \"sunset\": \"20:06\"," +
            "                \"night\": {" +
            "                    \"weather\": \"小雨\"," +
            "                    \"templow\": \"25\"," +
            "                    \"img\": \"7\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }," +
            "                \"day\": {" +
            "                    \"weather\": \"阵雨\"," +
            "                    \"temphigh\": \"31\"," +
            "                    \"img\": \"3\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }" +
            "            }," +
            "            {" +
            "                \"date\": \"2018-07-19\"," +
            "                \"week\": \"星期四\"," +
            "                \"sunrise\": \"06:08\"," +
            "                \"sunset\": \"20:06\"," +
            "                \"night\": {" +
            "                    \"weather\": \"小雨\"," +
            "                    \"templow\": \"24\"," +
            "                    \"img\": \"7\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }," +
            "                \"day\": {" +
            "                    \"weather\": \"阵雨\"," +
            "                    \"temphigh\": \"31\"," +
            "                    \"img\": \"3\"," +
            "                    \"winddirect\": \"持续无风向\"," +
            "                    \"windpower\": \"微风\"" +
            "                }" +
            "            }" +
            "        ]," +
            "        \"yin\": {" +
            "            \"lunar_calendar\": \"二0一八年 六月 初一日\"," +
            "            \"branch\": \"戊戌年 己未月 丙午日\"," +
            "            \"zodiac\": \"狗\"," +
            "            \"suitable\": \"【日值受死 大事勿用】 破土　启鑽　修坟　斋醮　纳采　开市　祭祀 祈福　求嗣　解除　纳财　栽种　塞穴　立券 筑堤\"," +
            "            \"avoid\": \"【日值受死 大事勿用】 嫁娶　移徙　上梁　安葬　经络　纳畜　入宅 置产　修造　动土　行舟　求医　赴任　针灸 开池　出行　竖柱　盖屋\"" +
            "        }" +
            "    }" +
            "}";

}
